{"class_name": "Model", "config": {"name": "LearningEmbeddings", "layers": [{"name": "LeftInput", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 634], "dtype": "float32", "sparse": false, "name": "LeftInput"}, "inbound_nodes": []}, {"name": "RightInput", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 634], "dtype": "float32", "sparse": false, "name": "RightInput"}, "inbound_nodes": []}, {"name": "DenseLayer1", "class_name": "Dense", "config": {"name": "DenseLayer1", "trainable": true, "units": 80, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LeftInput", 0, 0, {}]], [["RightInput", 0, 0, {}]]]}, {"name": "DenseLayer2", "class_name": "Dense", "config": {"name": "DenseLayer2", "trainable": true, "units": 40, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["DenseLayer1", 0, 0, {}]], [["DenseLayer1", 1, 0, {}]]]}, {"name": "DenseLayer3", "class_name": "Dense", "config": {"name": "DenseLayer3", "trainable": true, "units": 20, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["DenseLayer2", 0, 0, {}]], [["DenseLayer2", 1, 0, {}]]]}, {"name": "CosineSimilarity", "class_name": "Dot", "config": {"name": "CosineSimilarity", "trainable": true, "axes": 1, "normalize": true}, "inbound_nodes": [[["DenseLayer3", 0, 0, {}], ["DenseLayer3", 1, 0, {}]]]}, {"name": "Output", "class_name": "Dense", "config": {"name": "Output", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "NonNeg", "config": {}}, "bias_constraint": null}, "inbound_nodes": [[["CosineSimilarity", 0, 0, {}]]]}], "input_layers": [["LeftInput", 0, 0], ["RightInput", 0, 0]], "output_layers": [["Output", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}